cs/data representation/data representation.tex
% Created 2022-09-07 Wed 17:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Shayan Naqvi}
\date{\today}
\title{Data Representation}
\hypersetup{
 pdfauthor={Shayan Naqvi},
 pdftitle={Data Representation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Number systems}
\label{sec:orgdb3c167}
\subsubsection{Binary}
\label{sec:orge7a352b}
A base 2 number system consisting only of 1s and 0s.
\subsubsection{Denary}
\label{sec:orge2f174e}
A base 10 number system consisting of ten separate digits (0-9).
\subsubsection{Hexadecimal}
\label{sec:org4f536c6}
A base 16 number system consisting of digits 0-9 and letters A-F.
\begin{enumerate}
\item Uses of hexadecimal
\label{sec:org970c512}
\begin{enumerate}
\item Error codes/memory dumps
\begin{itemize}
\item Error codes are often shown as hexadecimal values. These numbers refer to the memory location of the error. The numbers need to be interpreted correctly in order to fix the error.
\end{itemize}
\item MAC addresses
\begin{itemize}
\item MAC stands for Media Access Control. It is a unique hexadecimal number which identifies a device on a network. The MAC address refers to the network interface card (NIC) of the device. This address is rarely changed so that a particular device may be identified regardless of where it is.
\item The format of a MAC address is usually as follows: \(NN:NN:NN:DD:DD:DD\) or \(NN-NN-NN-DD-DD-DD\).
\begin{itemize}
\item The first half of the address (NN:NN:NN) identifies the manufacturer of the device.
\item The second half of the address (DD:DD:DD) is the serial number of the device. This part of the address is unique to each device.
\end{itemize}
\end{itemize}
\item IP addresses
\begin{itemize}
\item Each device connected to a network is given an address known as an IP (Internet Protocol) address. An IP (version 6) address is a 128-bit number broken down into 16-bit chunks, represented by a hexadecimal number. E.g.,
\begin{itemize}
\item a8fb:7a88:fff0:0fff:3d21:2085:66fb:f0fa
\end{itemize}
\end{itemize}
\item Colour codes (HEX)
\begin{itemize}
\item The HEX colour system is a method of representing specific colours through hexadecimal values. Their structure is as follows:
\begin{itemize}
\item \#FF 00 00 represents red.
\item \#00 FF 00 represents green.
\item \#00 00 FF represents blue.
\end{itemize}
\item These values are then mixed together to form a specific colour. For e.g.,
\begin{itemize}
\item \#FF 00 FF represents fuchsia.
\item \#FF 80 00 represents orange.
\item \#B1 89 04 represents tan.
\item \#FF FF FF represents white.
\item \#00 00 00 represents black.
\item \#73 73 73 represents grey.
\end{itemize}
\item There are 256 variants for red, green and blue, making a total of about 16.7 million colours.
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsection{Conversions}
\label{sec:org6b41dc9}
\subsubsection{Binary --> Denary}
\label{sec:org98c6692}
The binary digits are placed under the corresponding denary headings. Any heading with a 1 below it is added together to form a complete denary number. E.g.,
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 1 & 1 & 0 & 1 & 1 & 1 & 0\\
\end{tabular}
\end{center}
128 + 64 + 32 + 8 + 4 + 2 = \((238)_{10}\)
\subsubsection{Denary --> Binary}
\label{sec:org8181cb2}
Find the appropriate denary headings that add up to the denary number to be converted. Place a 1 below each of the appropriate headings and group them up to form a converted binary digit. E.g., 142 --> Binary
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 0 & 0 & 0 & 1 & 1 & 1 & 0\\
\end{tabular}
\end{center}
128 + 8 + 4 + 2 + 1 = 142
\((10001110)_2\)
\subsubsection{Binary <-> Hexadecimal}
\label{sec:org84d587c}
\begin{center}
\begin{tabular}{rrr}
Binary Value & Hexadecimal Value & Denary Value\\
\hline
0000 & 0 & 0\\
0001 & 1 & 1\\
0010 & 2 & 2\\
0011 & 3 & 3\\
0100 & 4 & 4\\
0101 & 5 & 5\\
0110 & 6 & 6\\
0111 & 7 & 7\\
1000 & 8 & 8\\
1001 & 9 & 9\\
1010 & A & 10\\
1011 & B & 11\\
1100 & C & 12\\
1101 & D & 13\\
1110 & E & 14\\
1111 & F & 15\\
\end{tabular}
\end{center}
\begin{enumerate}
\item Split the binary digit into 4 parts. If the binary digit can't be evenly divided, add zeroes as needed. E.g.,
\begin{itemize}
\item 101101011 --> 1011 0101 1 --> 1011 0101 1000
\end{itemize}
\item Refer to the table above and make the appropriate conversions. E.g.,
\begin{itemize}
\item 1011 0101 1000 --> B 5 8 --> \((B58)_{16}\)
\end{itemize}
\end{enumerate}
\subsubsection{Hexadecimal --> Denary}
\label{sec:org796eb63}
The headings of hexadecimal digits need to be used. They are multiples of 16: 1, 16, 256, 4096, etc. Multiply each hexadecimal digit with the corresponding heading. E.g.,
\begin{itemize}
\item 45A --> Denary
\item (4 * 256) + (5 * 16) + (A(10) * 1) = 1024 + 80 + 10 = \((1114)_{10}\)
\end{itemize}
\subsection{Binary addition}
\label{sec:org9b24ebb}
Note the following when adding two binary digits:
\begin{center}
\begin{tabular}{lrr}
Addition & Carry & Sum\\
\hline
0 + 0 & 0 & 0\\
0 + 1 & 0 & 1\\
1 + 0 & 0 & 1\\
1 + 1 & 1 & 0\\
\end{tabular}
\end{center}
Note the following when adding three binary digits:
\begin{center}
\begin{tabular}{lrr}
Addition & Carry & Sum\\
\hline
0 + 0 + 0 & 0 & 0\\
0 + 0 + 1 & 0 & 1\\
0 + 1 + 0 & 0 & 1\\
0 + 1 + 1 & 1 & 0\\
1 + 0 + 0 & 0 & 1\\
1 + 0 + 1 & 1 & 0\\
1 + 1 + 0 & 1 & 0\\
1 + 1 + 1 & 1 & 1\\
\end{tabular}
\end{center}
Shorthand:
\begin{itemize}
\item 0 + 0 = 0
\item 0 + 1 (in any way) = 1 as sum, 0 carried
\item 1 + 1 (in any way) = 0 as sum, 1 carried
\item 1 + 1 + 1 = 1 as sum and carried
\end{itemize}
\subsubsection{Examples}
\label{sec:org2dbe38b}
\begin{enumerate}
\item 00100111 + 01001010
\begin{center}
\begin{tabular}{lrrrrrrrr}
 & 0 & 0 & 1 & 0 & 0 & 1 & 1 & 1\\
+ & 0 & 1 & 0 & 0 & 1 & 0 & 1 & 0\\
= & 0 & 1 & 1 & 1 & 0 & 0 & 0 & 1\\
\end{tabular}
\end{center}
\item 01111110 + 00111110
\begin{center}
\begin{tabular}{lrrrrrrrr}
 & 0 & 1 & 1 & 1 & 1 & 1 & 1 & 0\\
+ & 0 & 0 & 1 & 1 & 1 & 1 & 1 & 0\\
= & 1 & 0 & 1 & 1 & 1 & 1 & 0 & 0\\
\end{tabular}
\end{center}
\end{enumerate}
\subsubsection{Overflow errors}
\label{sec:org9c7464d}
When the sum of two binary numbers exceeds 8 bits (i.e. 9 bits) the computer returns an overflow error. This means the number is too large to store in an 8-bit register. Therefore the solution would be to use a register with a larger capacity, i.e. a 16, 32, or 64-bit register.
\subsection{Multiplication/division with binary digits}
\label{sec:org4146a7e}
A logical shift on a binary digit refers to shifting binary digits either to the left or right.
\begin{itemize}
\item A shift to the right is equivalent to dividing the binary number by 2.
\item A shift to the left is equivalent to multiplying the binary number by 2.
\end{itemize}
Any vacant positions are replaced with a zero.
\subsubsection{Examples}
\label{sec:org660ad97}
\begin{enumerate}
\item The denary number 21 is 00010101 in binary. Putting this into an 8-bit register:
\begin{center}
\begin{tabular}{rrrrrrrr}
0 & 0 & 0 & 1 & 0 & 1 & 0 & 1\\
\end{tabular}
\end{center}
Shifting the bits once place to the left:
\begin{center}
\begin{tabular}{rrrrrrrr}
0 & 0 & 1 & 0 & 1 & 0 & 1 & 0\\
\end{tabular}
\end{center}
The value of this register is now 21 * 2 = 42. This can be checked by converting this new binary number into denary.
\item The denary number 21 is 00010101 in binary. Putting this into an 8-bit register:
\begin{center}
\begin{tabular}{rrrrrrrr}
0 & 0 & 0 & 1 & 0 & 1 & 0 & 1\\
\end{tabular}
\end{center}
Shifting the bits two places left:
\begin{center}
\begin{tabular}{rrrrrrrr}
0 & 1 & 0 & 1 & 0 & 1 & 0 & 0\\
\end{tabular}
\end{center}
The binary number 1010100 is 84 in denary, which is \(21 * 2^2\).
Now let us shift the original number 4 places left:
\begin{center}
\begin{tabular}{rrrrrrrr}
0 & 1 & 0 & 1 & 0 & 0 & 0 & 0\\
\end{tabular}
\end{center}
The left-most 1-bit has been lost. The result of 0101000 is 80, which is incorrect. This raises an error because the maximum number of left shifts possible in this register have been exceeded.
\end{enumerate}
\subsection{Two's complement}
\label{sec:orgecc0b67}
This is a method of binary <-> denary conversion that allows us to represent negative numbers.
\begin{enumerate}
\item Converting -17 into binary
\begin{enumerate}
\item Represent -17 in positive binary
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
0 & 0 & 0 & 1 & 0 & 0 & 0 & 1\\
\end{tabular}
\end{center}
\item Invert all binary digits (1's complement)
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 1 & 1 & 0 & 1 & 1 & 1 & 0\\
\end{tabular}
\end{center}
\item Add 1 to the inverted binary digits (2's complement)
\begin{center}
\begin{tabular}{lrrrrrrrr}
 & 1 & 1 & 1 & 0 & 1 & 1 & 1 & 0\\
+ & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1\\
= & 1 & 1 & 1 & 0 & 1 & 1 & 1 & 1\\
\end{tabular}
\end{center}
\item Verify by converting the new binary number into denary, with a negative 128 heading.
\begin{center}
\begin{tabular}{rrrrrrrr}
-128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 1 & 1 & 0 & 1 & 1 & 1 & 1\\
\end{tabular}
\end{center}
-128 + 64 + 32 + 8 + 4 + 2 + 1 = -17
\end{enumerate}
\item Converting -44 into binary
\begin{enumerate}
\item Represent -44 in positive binary
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
0 & 0 & 1 & 0 & 1 & 1 & 0 & 0\\
\end{tabular}
\end{center}
\item Invert all binary digits
\begin{center}
\begin{tabular}{rrrrrrrr}
128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 1 & 0 & 1 & 0 & 0 & 1 & 1\\
\end{tabular}
\end{center}
\item Add 1 to the inverted digits
\begin{center}
\begin{tabular}{lrrrrrrrr}
 & 1 & 1 & 0 & 1 & 0 & 0 & 1 & 1\\
+ & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1\\
= & 1 & 1 & 0 & 1 & 0 & 1 & 0 & 0\\
\end{tabular}
\end{center}
\item Verify
\begin{center}
\begin{tabular}{rrrrrrrr}
-128 & 64 & 32 & 16 & 8 & 4 & 2 & 1\\
1 & 1 & 0 & 1 & 0 & 1 & 0 & 0\\
\end{tabular}
\end{center}
-128 + 64 + 16 + 4 = -44
\end{enumerate}
\end{enumerate}
\section{Text, sound and images}
\label{sec:org158a3dd}
\subsection{Character sets (ASCII + Unicode)}
\label{sec:orgb697801}
\subsubsection{ASCII}
\label{sec:org698599d}
ASCII stands for the \textbf{American Standard Code for Information Interchange}. It is a character set consisting of 7-bit codes that represent the letters, numbers and characters found on a standarf keyboard. The codes range from 0-127 (denary)/00-7F (Hexadecimal).
\begin{enumerate}
\item Extended ASCII
\label{sec:org3c245b8}
Extended ASCII uses 8-bit (0-255 in denary/00-FF in hexadecimal) that allow for another 128 codes that represent non-English letters and some graphical characters.
\item Disadvantages of ASCII
\label{sec:org9ea02cc}
\begin{itemize}
\item Does not represent non-latin character scripts (i.e. Chinese or Arabic).
\item Limited set of characters.
\end{itemize}
\end{enumerate}
\subsubsection{Unicode}
\label{sec:org858cdc0}
Unicode is a character set, similar in concept to ASCII, that aims to create a universally standard set of characters, inclusive of different scripts and languages (i.e. non-latin scripts).
\subsection{Sound}
\label{sec:orgf439cb3}
By nature, sound is analogue data. Computers can process only digital data, therefore, in order for a computer to process sound, it needs to be sampled (measuring the amplitude of the sound wave) via an ADC, an \textbf{Analogue to Digital Converter.}
\subsubsection{Converting sound to digital data}
\label{sec:org969f5a2}
\begin{enumerate}
\item The amplitude of the sound wave is measured at regular time intervals (\ref{sec:org63c38b0}). Since the sound cannot be measured precisely, approximate values are stored. These values can be represented in binary with an appropriate number of bits.
\item Sampling yields an approximate digital representation of the sound wave.
\item Each sample of the sound wave is subsequently encoded as a series of binary digits.
\end{enumerate}
\subsubsection{Sampling resolution (bit depth)}
\label{sec:org96732f9}
The number of bits used to measure a sample affects how accurate the final representation of the sound is. If a sound is sampled using 10 bits, the accuracy of the representation would be lacking in comparison to a sound sampled with a higher bit depth, such as 127.
\subsubsection{Sampling rate}
\label{sec:org63c38b0}
The number of sound samples taken per second is known as the sampling rate. This rate is measured in Hertz (Hz). In this context, 1 Hz refers to 1 sample per second. 2 Hz would refer to 2 samples per second.
\subsubsection{Quality}
\label{sec:org368fe6b}
Higher sampling rates or larger sampling resolution yeilds a more faithful representation of the original sound. However, the higher the sampling rates and resolution, the higher the file size.
\begin{center}
\begin{tabular}{ll}
Benefits & Drawbacks\\
\hline
Larger dynamic range & Larger file size\\
Better sound quality & Takes longer to transmit/download audio files\\
Less sound distortion & Requires greater processing power\\
\end{tabular}
\end{center}
\subsection{Bitmap images}
\label{sec:orgca30d23}
A bitmap image is made up of pixels. Each pixel can be represented as a binary number, so an image is sotred as a series of binary numbers.
\begin{itemize}
\item A BW image requires 1 bit per pixel, meaning any pixel can be either a 1 or 0 to represent black or white.
\item If each pixel is represented by 2 bits, then there are 4 possible colours (00, 01, 10, 11).
\item If each pixel is represented by 4 bits, then there are 16 possible colours (0000, 0001, 0010, 0011, 0100, etc\ldots{}).
\end{itemize}
\subsubsection{Colour depth}
\label{sec:org0c1181c}
The number of bits used to represent each pixel is called colour depth. 8 bits of colour depth mean that each pixel can be one of 256 colours (\(2^8\)). Most modern computers handle 24 bit colour depth, meaning over 16 million colours can be represented.
\subsubsection{Image resolution}
\label{sec:org113039b}
Image resolution refers to the number of pixels that make up a photograph. More pixels = a higher image resolution. A greater image resolution, however, comes with a larger file size (and all subsequent large file-size drawbacks).
\section{Data storage + file compression}
\label{sec:orga67c0ed}
\end{document}
